**Q1.**
Write a function in python that inputs a dataframe and identify which columns have date in them. Using these date columns make new columns which are difference between these columns taking 2 at a time. (for instance if there is date1, date2, date3 columns, output should be like date1-date2, date2-date3, date1-date3). For this problem only, print out data in the colab.

Useful Libraries

In [ ]:
import pandas as pd
import numpy as np

**1.**Making a dummy dataset by myself.
There are different alias for freq in date_range, some are\
B         business day frequency   
D         calendar day frequency  
W         weekly frequency  
M         month end frequency

In [ ]:
date_1=pd.Series(pd.date_range('2020-1-1',periods=6,freq='D'))
date_2=pd.Series(pd.date_range('2020-2-1',periods=6,freq='M'))
date_3=pd.Series(pd.date_range('2020-3-1',periods=6,freq='A'))
df=pd.DataFrame({'date1':date_1,'date2':date_2,'date3':date_3,'Val' : np.random.randn(len(date_1))})
df

       date1      date2      date3       Val
0 2020-01-01 2020-02-29 2020-12-31  0.722365
1 2020-01-02 2020-03-31 2021-12-31 -0.219948
2 2020-01-03 2020-04-30 2022-12-31 -1.624080
3 2020-01-04 2020-05-31 2023-12-31 -0.927171
4 2020-01-05 2020-06-30 2024-12-31 -1.010072
5 2020-01-06 2020-07-31 2025-12-31  0.586287

Now,as per question, 3 cases to consider-

1. all entries in date column are valid
2. Date column might have some invalid entries in them
3. Date can be of different format throughout the column

All Valid Entries

Defining a function to find difference between these columns:
This function detect columns by itself and define new columns as per requirement.

In [ ]:
def diff_in_dates(input_df):
    #finding all date_time columns
    input_df_date_only=input_df.select_dtypes(include=['datetime64'])
    #iterating over columns
    for i in range(len(input_df_date_only.columns)-1):
        for n in range(i+1,len(input_df_date_only.columns)):
            #creating column with new name and taking difference in term of days which can be changed by changing alais "D"
            # to "W" for week and "Y" for year
            input_df['diff{}and{}'.format(i+1,n+1)]=(input_df.iloc[:, i]-input_df.iloc[:, n])/np.timedelta64(1,'D')

In [ ]:
diff_in_dates(df)
print(df)

       date1      date2      date3       Val  diff1and2  diff1and3  diff2and3
0 2020-01-01 2020-02-29 2020-12-31  0.722365      -59.0     -365.0     -306.0
1 2020-01-02 2020-03-31 2021-12-31 -0.219948      -89.0     -729.0     -640.0
2 2020-01-03 2020-04-30 2022-12-31 -1.624080     -118.0    -1093.0     -975.0
3 2020-01-04 2020-05-31 2023-12-31 -0.927171     -148.0    -1457.0    -1309.0
4 2020-01-05 2020-06-30 2024-12-31 -1.010072     -177.0    -1822.0    -1645.0
5 2020-01-06 2020-07-31 2025-12-31  0.586287     -207.0    -2186.0    -1979.0

2. Date can be of different format throughout the column

In [ ]:
from datetime import *
date_4=pd.date_range('2020-2-1',periods=6,freq='M')
date_4=date_4.strftime("%d %B, %Y")
date_4=pd.Series(date_4)

In [ ]:
new_df=pd.DataFrame({'date1':date_1,'date2':date_2,'date3':date_3,'date4':date_4,'Val' : np.random.randn(len(date_1))})

Now we have a column with different format

In [ ]:
new_df

       date1      date2      date3              date4       Val
0 2020-01-01 2020-02-29 2020-12-31  29 February, 2020 -1.034262
1 2020-01-02 2020-03-31 2021-12-31     31 March, 2020  1.222450
2 2020-01-03 2020-04-30 2022-12-31     30 April, 2020  1.549054
3 2020-01-04 2020-05-31 2023-12-31       31 May, 2020  0.438067
4 2020-01-05 2020-06-30 2024-12-31      30 June, 2020 -0.339537
5 2020-01-06 2020-07-31 2025-12-31      31 July, 2020  0.237703

Converting column to standard format

In [ ]:
# convert the 'date4' column to datetime format 
#Passing infer_datetime_format=True can often-times speedup a parsing if its not an ISO8601 format exactly, but in a regular format.
# if format="%m/%d/%y" is not specified it will be converted to standard
new_df['date4']=pd.to_datetime(new_df['date4'],format="%m/%d/%y",infer_datetime_format=True)

In [ ]:
new_df

       date1      date2      date3      date4       Val
0 2020-01-01 2020-02-29 2020-12-31 2020-02-29 -1.034262
1 2020-01-02 2020-03-31 2021-12-31 2020-03-31  1.222450
2 2020-01-03 2020-04-30 2022-12-31 2020-04-30  1.549054
3 2020-01-04 2020-05-31 2023-12-31 2020-05-31  0.438067
4 2020-01-05 2020-06-30 2024-12-31 2020-06-30 -0.339537
5 2020-01-06 2020-07-31 2025-12-31 2020-07-31  0.237703

Now running the function from above

In [ ]:
diff_in_dates(new_df)
new_df

       date1      date2      date3  ... diff2and3  diff2and4  diff3and4
0 2020-01-01 2020-02-29 2020-12-31  ...    -306.0        0.0      306.0
1 2020-01-02 2020-03-31 2021-12-31  ...    -640.0        0.0      640.0
2 2020-01-03 2020-04-30 2022-12-31  ...    -975.0        0.0      975.0
3 2020-01-04 2020-05-31 2023-12-31  ...   -1309.0        0.0     1309.0
4 2020-01-05 2020-06-30 2024-12-31  ...   -1645.0        0.0     1645.0
5 2020-01-06 2020-07-31 2025-12-31  ...   -1979.0        0.0     1979.0

[6 rows x 11 columns]

Type 3. Date column might have some invalid entries in them

In [ ]:
next_df=pd.DataFrame({'date1':date_1,'date2':date_2,'date3':date_3,'Val' : np.random.randn(len(date_1))})

In [ ]:
next_df

       date1      date2      date3       Val
0 2020-01-01 2020-02-29 2020-12-31  0.159806
1 2020-01-02 2020-03-31 2021-12-31 -0.211161
2 2020-01-03 2020-04-30 2022-12-31 -2.442862
3 2020-01-04 2020-05-31 2023-12-31  0.502708
4 2020-01-05 2020-06-30 2024-12-31 -1.687591
5 2020-01-06 2020-07-31 2025-12-31  0.631874

inserting invalid entry to dataframe

In [ ]:
next_df.iloc[5,[2]]='abcd'

In [ ]:
next_df

       date1      date2                date3       Val
0 2020-01-01 2020-02-29  2020-12-31 00:00:00  0.159806
1 2020-01-02 2020-03-31  2021-12-31 00:00:00 -0.211161
2 2020-01-03 2020-04-30  2022-12-31 00:00:00 -2.442862
3 2020-01-04 2020-05-31  2023-12-31 00:00:00  0.502708
4 2020-01-05 2020-06-30  2024-12-31 00:00:00 -1.687591
5 2020-01-06 2020-07-31                 abcd  0.631874

Passing errors=’coerce’ will force an out-of-bounds date to NaT, in addition to forcing non-dates (or non-parseable dates) to NaT.

In [ ]:
next_df['date3']=pd.to_datetime(next_df['date3'],infer_datetime_format=True, errors='coerce')

In [ ]:
next_df

       date1      date2      date3       Val
0 2020-01-01 2020-02-29 2020-12-31  0.159806
1 2020-01-02 2020-03-31 2021-12-31 -0.211161
2 2020-01-03 2020-04-30 2022-12-31 -2.442862
3 2020-01-04 2020-05-31 2023-12-31  0.502708
4 2020-01-05 2020-06-30 2024-12-31 -1.687591
5 2020-01-06 2020-07-31        NaT  0.631874

**The invalid Entry is converted to NaT**

Now running the function from above to find the difference

In [ ]:
# function to find difference between date columns
diff_in_dates(next_df)
next_df

       date1      date2      date3       Val  diff1and2  diff1and3  diff2and3
0 2020-01-01 2020-02-29 2020-12-31  0.159806      -59.0     -365.0     -306.0
1 2020-01-02 2020-03-31 2021-12-31 -0.211161      -89.0     -729.0     -640.0
2 2020-01-03 2020-04-30 2022-12-31 -2.442862     -118.0    -1093.0     -975.0
3 2020-01-04 2020-05-31 2023-12-31  0.502708     -148.0    -1457.0    -1309.0
4 2020-01-05 2020-06-30 2024-12-31 -1.687591     -177.0    -1822.0    -1645.0
5 2020-01-06 2020-07-31        NaT  0.631874     -207.0        NaN        NaN

**Q2.**Write a function in python that take dataframe as input and drop columns having Pearson correlation more than 0.85

In [ ]:
# Importing basic libraries
from numpy.random import randn
from numpy.random import seed
from scipy.stats import pearsonr

In [ ]:
seed(1)
# preparing data to find correlation b/w
data1 = 20 * randn(1000) + 100
data2 = data1 + (10 * randn(1000) + 50)
data3 = data2+(10 * 2*randn(1000) + 50) - data1
data4=data2+data3-data1

Creating a DataFrame with random values:

In [ ]:
pcdf=pd.DataFrame({'data1':data1,'data2':data2,'data3':data3,'data4':data4})

Function to find Pearson correlation bw any two columns of dataframe and then dropping the columns if Pearson correlation is more than 0.85

In [ ]:
def pc(dataset, threshold):
    # for loop to take 2 clumn at a time
    for i in range(len(dataset.columns)-1):
        for n in range(i+1,len(dataset.columns)):
            corr, _ = pearsonr(dataset.iloc[:, i], dataset.iloc[:, n])
            if corr > 0.85:
                dataset.drop[dataset.columns[i]]
                # move to next column if one column is dropped 
                break
    

    print(dataset)
pc(pcdf,0.85)

TypeError: ignored